In [1]:
from pandas import DataFrame
import json

In [5]:
raw_data = """
        {
        "city" : ["Tripoli", "Tripoli", "Rome", "Rome", "Sydney", "Sydney"],
        "rank" : ["1st", "2nd", "1st", "2nd", "1st", "2nd"],
        "score1" : [44, 48, 39, 41, 38, 44],
        "score2" : [67, 63, 55, 70, 64, 77]
        }
        """

In [6]:
raw_data

'\n        {\n        "city" : ["Tripoli", "Tripoli", "Rome", "Rome", "Sydney", "Sydney"],\n        "rank" : ["1st", "2nd", "1st", "2nd", "1st", "2nd"],\n        "score1" : [44, 48, 39, 41, 38, 44],\n        "score2" : [67, 63, 55, 70, 64, 77]\n        }\n        '

In [7]:
data = json.loads(raw_data)
data

{'city': ['Tripoli', 'Tripoli', 'Rome', 'Rome', 'Sydney', 'Sydney'],
 'rank': ['1st', '2nd', '1st', '2nd', '1st', '2nd'],
 'score1': [44, 48, 39, 41, 38, 44],
 'score2': [67, 63, 55, 70, 64, 77]}

In [9]:
data['city']

['Tripoli', 'Tripoli', 'Rome', 'Rome', 'Sydney', 'Sydney']

In [10]:
json.dumps(data)

'{"city": ["Tripoli", "Tripoli", "Rome", "Rome", "Sydney", "Sydney"], "rank": ["1st", "2nd", "1st", "2nd", "1st", "2nd"], "score1": [44, 48, 39, 41, 38, 44], "score2": [67, 63, 55, 70, 64, 77]}'

In [11]:
df = DataFrame(data)

In [12]:
df

      city rank  score1  score2
0  Tripoli  1st      44      67
1  Tripoli  2nd      48      63
2     Rome  1st      39      55
3     Rome  2nd      41      70
4   Sydney  1st      38      64
5   Sydney  2nd      44      77